###############################################################
#  Generated by:      Cadence Innovus 21.17-s075_1
#  OS:                Linux x86_64(Host ID vlsi410)
#  Generated on:      Wed Nov 27 00:44:30 2024
#  Design:            riscv_core
#  Command:           saveDesign -cellview {riscv_library_PNR riscv_core layout}
###############################################################
current_design riscv_core
set_clock_gating_check -rise -setup 0 
set_clock_gating_check -fall -setup 0 
create_clock [get_ports {i_clk}]  -name clk -period 10.000000 -waveform {0.000000 5.000000}
set_propagated_clock  [get_ports {i_clk}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_rstn}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_rstn}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_rstn}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_rstn}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_clk}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_clk}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_clk}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_clk}]
set_load -pin_load -max  0.5  [get_ports {o_imem_en}]
set_load -pin_load -min  0.5  [get_ports {o_imem_en}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[8]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[8]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[7]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[7]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[6]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[6]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[5]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[5]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[4]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[4]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[3]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[3]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[2]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[2]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[1]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[1]}]
set_load -pin_load -max  0.5  [get_ports {o_imem_addr[0]}]
set_load -pin_load -min  0.5  [get_ports {o_imem_addr[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_imem_read[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_imem_read[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_imem_read[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_imem_read[0]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_en}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_en}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_we}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_we}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[8]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[8]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[7]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[7]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[6]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[6]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[5]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[5]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[4]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[4]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[3]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[3]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[2]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[2]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[1]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[1]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_addr[0]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_addr[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[31]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[30]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[29]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[28]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[27]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[26]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[25]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[24]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[23]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[22]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[21]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[20]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[19]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[18]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[17]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[16]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[15]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[14]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[13]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[12]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[11]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[10]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[9]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[8]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[7]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[6]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[5]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[4]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[3]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[2]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[1]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_dmem_read[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_dmem_read[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_dmem_read[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_dmem_read[0]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[31]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[31]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[30]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[30]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[29]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[29]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[28]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[28]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[27]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[27]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[26]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[26]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[25]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[25]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[24]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[24]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[23]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[23]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[22]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[22]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[21]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[21]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[20]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[20]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[19]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[19]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[18]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[18]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[17]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[17]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[16]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[16]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[15]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[15]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[14]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[14]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[13]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[13]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[12]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[12]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[11]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[11]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[10]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[10]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[9]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[9]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[8]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[8]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[7]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[7]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[6]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[6]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[5]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[5]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[4]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[4]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[3]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[3]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[2]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[2]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[1]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[1]}]
set_load -pin_load -max  0.5  [get_ports {o_dmem_write[0]}]
set_load -pin_load -min  0.5  [get_ports {o_dmem_write[0]}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_scan_en}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_scan_en}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_scan_en}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_scan_en}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_test_mode}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_test_mode}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_test_mode}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_test_mode}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -min -pin Y [get_ports {i_tdi}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -min -pin Y [get_ports {i_tdi}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -rise -max -pin Y [get_ports {i_tdi}]
set_driving_cell -lib_cell BUFX20 -library slow_vdd1v0 -fall -max -pin Y [get_ports {i_tdi}]
set_load -pin_load -max  0.5  [get_ports {o_tdo}]
set_load -pin_load -min  0.5  [get_ports {o_tdo}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[20]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[20]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[13]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[13]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[30]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[30]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[23]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[23]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[16]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[16]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[3]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[3]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[7]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[7]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[25]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[25]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[18]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[18]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[28]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[28]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[12]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[12]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[8]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[8]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[3]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[3]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[21]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[21]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[14]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[14]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[31]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[31]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[24]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[24]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[17]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[17]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_tdi}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_tdi}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[4]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[4]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[8]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[8]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[26]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[26]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[19]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[19]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[10]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[10]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[29]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[29]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[20]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[20]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[13]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[13]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[9]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[9]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[0]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[0]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[4]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[4]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[22]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[22]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[15]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[15]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[25]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[25]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[18]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[18]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[5]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[5]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[9]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[9]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[27]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[27]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[0]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[0]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[11]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[11]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[21]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[21]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[14]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[14]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[1]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[1]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[5]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[5]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[30]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[30]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[23]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[23]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[16]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[16]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[26]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[26]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[19]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[19]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_rstn}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_rstn}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[10]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[10]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[6]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[6]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[28]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[28]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[1]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[1]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[12]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[12]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_scan_en}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_scan_en}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[22]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[22]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[15]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[15]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_test_mode}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_test_mode}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[2]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[2]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[6]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[6]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[31]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[31]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[24]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[24]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[17]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[17]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[27]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[27]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[11]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[11]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[7]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[7]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_imem_read[29]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_imem_read[29]}]
set_input_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {i_dmem_read[2]}]
set_input_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {i_dmem_read[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[1]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[5]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[31]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[31]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[24]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[24]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[17]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[17]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[0]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[6]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[29]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[29]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[1]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[5]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[20]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[20]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[13]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[13]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[2]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[6]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[25]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[25]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[18]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[18]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_tdo}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_tdo}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[1]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[1]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_en}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_en}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[7]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[2]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[6]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[6]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[21]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[21]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[14]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[14]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[3]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[7]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[26]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[26]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[19]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[19]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[2]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[2]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[10]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[10]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[8]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[8]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[3]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[7]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[7]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[22]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[22]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[15]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[15]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_en}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_en}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[4]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[27]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[27]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[8]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[8]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[3]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[3]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[11]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[11]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[9]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[9]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[0]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[4]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[8]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[8]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[30]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[30]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[23]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[23]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[16]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[16]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[5]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[5]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_we}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_we}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[28]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[28]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_imem_addr[0]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_imem_addr[0]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_addr[4]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_addr[4]}]
set_output_delay -add_delay 0.1 -min -clock [get_clocks {clk}] [get_ports {o_dmem_write[12]}]
set_output_delay -add_delay 0.3 -max -clock [get_clocks {clk}] [get_ports {o_dmem_write[12]}]
set_clock_uncertainty 0.05 -hold [get_clocks {clk}]
set_clock_uncertainty 0.2 -setup [get_clocks {clk}]
set_false_path  -from [get_ports {i_rstn i_scan_en i_test_mode i_tdi}] 
